/***************************************************************
文    件:    print_fmt.c
功    能:    一些打印在屏幕上的输出格式
***************************************************************/
#include <stdio.h>

/***************************************************************
函    数:    print_in
功    能:    用户进入客户端的时候的使用提示
传入参数:    无
传出参数:    无
返回值  :    0:程序执行结果
****************************************************************/
int print_in()
{
    fprintf(stderr, "/******************欢迎进入聊天室******************/\n");
    fprintf(stderr, "/*****************请按下列提示操作*****************/\n");
    fprintf(stderr, "*                  注册: 请按0                     *\n");
    fprintf(stderr, "*                  登录：请按1                     *\n");
    fprintf(stderr, "*                  退出：请按2                     *\n");
    fprintf(stderr, "/**************************************************/\n");
}

/*****************************************************************
函    数:    print_chat
功    能:    用户聊天时候的选择聊天信息
传入参数:    无
传出参数:    无
返    回:    0
*****************************************************************/
int print_chat()
{
    fprintf(stderr, "/******************请选择您的聊天模式**********************/\n");
    fprintf(stderr, "*                 私聊        : 请按3                      *\n");
    fprintf(stderr, "*                 群聊        : 请按4                      *\n");
    fprintf(stderr, "*                 查看聊天记录: 请按5                      *\n");
    fprintf(stderr, "*                 查看在线用户: 请按6                      *\n");
    fprintf(stderr, "*                 退出        : 请按7                      *\n");
    fprintf(stderr, "*                 关闭服务器  : 请按8                      *\n");
    fprintf(stderr, "*                 设置禁言    : 请按9                      *\n");
    fprintf(stderr, "*                 踢出用户    : 请按k                      *\n");
    fprintf(stderr, "*提示：踢出所有用户,关闭服务器，设置禁言功能是超级用户功能 *\n");
    fprintf(stderr, "/**********************************************************/\n");
}
